names_smoke = ["白烟_柱状_深", "白烟_柱状_浅", "白烟_弥散状_浅", "白烟_弥散状_深", "白烟_云团状", "白烟_带状_深", "白烟_带状_浅", "白烟_点状", 
            "黄烟_柱状_深", "黄烟_柱状_浅", "黄烟_弥散状_浅", "黄烟_弥散状_深", "黄烟_云团状", "黄烟_带状_深", "黄烟_带状_浅", "黄烟_点状", 
            "黑烟_柱状_深", "黑烟_柱状_浅", "黑烟_弥散状_浅", "黑烟_弥散状_深", "黑烟_云团状", "黑烟_带状_深", "黑烟_带状_浅", "黑烟_点状", 
            "灰烟_柱状_深", "灰烟_柱状_浅", "灰烟_弥散状_浅", "灰烟_弥散状_深", "灰烟_云团状", "灰烟_带状_深", "灰烟_带状_浅", "灰烟_点状", 
            "红烟_弥散状_浅", "红烟_弥散状_深", "红烟_带状_深", "红烟_带状_浅", "红烟_点状", 
            "绿烟_弥散状_浅", "绿烟_弥散状_深", "绿烟_带状_深", "绿烟_带状_浅", "绿烟_点状", 
            "带状雾", "片状雾", "带状云", "片状云", "点状火", "带状火_小", "带状火_大", "团状火", "柱状火"]
names_smoke_merge = {
        "烟": ["白烟_柱状_深", "白烟_柱状_浅", "白烟_弥散状_浅", "白烟_弥散状_深", "白烟_云团状", "白烟_带状_深", "白烟_带状_浅", "白烟_点状", 
        "黄烟_柱状_深", "黄烟_柱状_浅", "黄烟_弥散状_浅", "黄烟_弥散状_深", "黄烟_云团状", "黄烟_带状_深", "黄烟_带状_浅", "黄烟_点状", 
        "黑烟_柱状_深", "黑烟_柱状_浅", "黑烟_弥散状_浅", "黑烟_弥散状_深", "黑烟_云团状", "黑烟_带状_深", "黑烟_带状_浅", "黑烟_点状", 
        "灰烟_柱状_深", "灰烟_柱状_浅", "灰烟_弥散状_浅", "灰烟_弥散状_深", "灰烟_云团状", "灰烟_带状_深", "灰烟_带状_浅", "灰烟_点状", 
        "红烟_弥散状_浅", "红烟_弥散状_深", "红烟_带状_深", "红烟_带状_浅", "红烟_点状", 
        "绿烟_弥散状_浅", "绿烟_弥散状_深", "绿烟_带状_深", "绿烟_带状_浅", "绿烟_点状"], 
        "雾": ["带状雾", "片状雾"], 
        "云": ["带状云", "片状云"], 
        "火": ["点状火", "带状火_小", "带状火_大", "团状火", "柱状火"]
        }
# print(names_smoke_merge["云"])